Revit 2026 API

# LinkLoadContentSetLinkDataPath Method

---

Sets the Link data path owned by this LinkLoadContent object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLinkDataPath(
	ModelPath linkPath
)
```
```vb
Public Sub SetLinkDataPath (
	linkPath As ModelPath
)
```
```cpp
public:
void SetLinkDataPath(
	ModelPath^ linkPath
)
```
```fsharp
member SetLinkDataPath :
        linkPath : ModelPath -> unit
```

#### Parameters

linkPath ModelPath
     The Links data path set for this LinkLoadContent object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This path must be a location accessible to Revit. Revit will attempt to load the link from this location.

#### Reference

LinkLoadContent Class

Autodesk.Revit.DB Namespace